RobertPatzke/homeautomation/libraries/nRF52840Radio/nRF52840Radio.cpp
//-----------------------------------------------------------------------------
// Thema:   Social Manufacturing Network / Development Environment
// Datei:   nRF52840Radio.h
// Editor:  Robert Patzke
// URI/URL: www.mfp-portal.de
//-----------------------------------------------------------------------------
// Lizenz:  CC-BY-SA  (wikipedia: Creative Commons)
//

#include "Arduino.h"
#include "nRF52840Radio.h"
#include <string.h>

// ----------------------------------------------------------------------------
// Initialisierungen
// ----------------------------------------------------------------------------

nRF52840Radio::nRF52840Radio()
{
  NrfRadioPtr->TASKS_DISABLE;   // Sender/Empfänger abgeschaltet
#ifdef nrfPowerDCDCEN
  *nrfPowerDCDCEN = 1;
#endif
#ifdef nrfClockTASKS_HFCLKSTART
  *nrfClockTASKS_HFCLKSTART = 1;
#endif
  NrfRadioPtr->POWER = 0;
  NrfRadioPtr->POWER = 1;

  irqCounter = 0;
  trfMode = txmBase;
  statisticPtr = NULL;
  recMode = true;
  pmPtr = (bcPduPtr) pduMem;
  psPtr = (bcPduPtr) pduSentS;
  pePtr = (bcPduPtr) pduSentE;
  eadM = false;
  nakM = false;
  comFin = false;
  comError = false;
  newValues = false;

  memset(statList,0,NrOfTxModes * sizeof(TxStatistics));
}

// ----------------------------------------------------------------------------
// Konfiguration
// ----------------------------------------------------------------------------

// Allgemeine Vorbereitungen
//
void  nRF52840Radio::begin()
{
  instPtr0 = this;      // Verzweigung im statischen Bereich setzen

  NrfRadioPtr->INTENCLR = 0xFFFFFFFF;   // Vorsichtshalber keine Interrupts

  // Interruptvektor setzen
  //
  __NVIC_SetVector((IRQn_Type) 1, (dword) nRF52840Radio::irqHandler0);
  __NVIC_SetPriority((IRQn_Type) 1, 1);
  __NVIC_EnableIRQ((IRQn_Type) 1);
}

// Setzen der Zugriffsadresse
//
void  nRF52840Radio::setAccessAddress(dword addr)
{
  dword prefix = addr >> 24;
  dword base = addr << 8;

  cfgData.base0   = NrfRadioPtr->BASE0        = base;
  cfgData.prefix0 = NrfRadioPtr->PREFIX0      = prefix;
  cfgData.txAddr  = NrfRadioPtr->TXADDRESS    = 0;
  cfgData.rxAddr  = NrfRadioPtr->RXADDRESSES  = 0x01;
}

// Telegrammparameter setzen
//
void  nRF52840Radio::setPacketParms(blePduType type)
{
  switch(type)
  {
    case bptAdv:
      cfgData.pCnf0     = NrfRadioPtr->PCNF0        = PCNF0_LFLEN(8) | PCNF0_S0LEN(1) | PCNF0_S1LEN(0);
      cfgData.pCnf1     = NrfRadioPtr->PCNF1        = PCNF1_MAXLEN(42) | PCNF1_BALEN(3) | PCNF1_WHITEEN(1);
      cfgData.modeCnf0  = NrfRadioPtr->MODECNF0     = 1;
      cfgData.crcCnf    = NrfRadioPtr->CRCCNF       = CRCCNF_LEN(3) | CRCCNF_SKIPADDR(1);
      cfgData.crcPoly   = NrfRadioPtr->CRCPOLY      = PolynomCRC;
      cfgData.crcInit   = NrfRadioPtr->CRCINIT      = AdvStartCRC;
      cfgData.packetPtr = NrfRadioPtr->PACKETPTR    = (dword) pduMem;
      cfgData.mode      = NrfRadioPtr->MODE         = 3;
      cfgData.dacnf     = NrfRadioPtr->DACNF        = 0x0FF00;
      break;

    case bptAux:
      break;
  }
}


// ----------------------------------------------------------------------------
// Steuerfunktionen und gezielte Prozessorzugriffe
// ----------------------------------------------------------------------------

// Schalten des Bewerbungskanals
//
void nRF52840Radio::setChannel(int nr)
{
  cfgData.frequency = NrfRadioPtr->FREQUENCY = channelList[nr].freq;
  cfgData.whiteInit = NrfRadioPtr->DATAWHITEIV = channelList[nr].idx;
}

// ----------------------------------------------------------------------------
//                      S e n d e n
// ----------------------------------------------------------------------------

// Einstellen der Sendeleistung
//
void  nRF52840Radio::setPower(int DBm)
{
  cfgData.txPower = NrfRadioPtr->TXPOWER = DBm;
}
// Senden eines Telegramms
// Es wird davon ausgeganen, das der Radio-Zustand = DISABLED ist
//
int nRF52840Radio::sendSync(bcPduPtr inPduPtr, TxStatePtr refState)
{
  int   retv = 0;
  NrfRadioPtr->INTENCLR = 0xFFFFFFFF;
  NrfRadioPtr->EVENTS_READY = 0;
  NrfRadioPtr->EVENTS_END = 0;
  memcpy((void *)pduMem, (void *)inPduPtr, sizeof(bcPdu));  // Daten kopieren
  if(refState != NULL)
    refState->prgLoopPrep = retv = 3 + sizeof(bcPdu);
  NrfRadioPtr->TASKS_TXEN = 1;                  // Starten des Anlaufes
  while(NrfRadioPtr->EVENTS_READY != 1) retv++; // Warten bis angelaufen
  if(refState != NULL)
    refState->evtLoopRampUp = retv - 3;
  NrfRadioPtr->TASKS_START = 1;                 // Starten des Sendevorgangs
  while(NrfRadioPtr->EVENTS_END != 1) retv++;   // Warten bis gesendet
  NrfRadioPtr->TASKS_DISABLE = 1;               // Sender abschalten
  if(refState != NULL)
  {
    refState->evtLoopTrans = retv - refState->evtLoopRampUp;
    refState->txBufferPtr = pduMem;
  }
  return(retv);
}

void  nRF52840Radio::send(bcPduPtr inPduPtr, TxMode txMode)
{
  send(inPduPtr, NULL, txMode, false);
}

void  nRF52840Radio::send(bcPduPtr inPduPtrE, bcPduPtr inPduPtrS, TxMode txMode, bool inNewValues)
{
  NrfRadioPtr->INTENCLR         = 0xFFFFFFFF;
  NrfRadioPtr->EVENTS_READY     = 0;
  NrfRadioPtr->EVENTS_END       = 0;
  NrfRadioPtr->EVENTS_DISABLED  = 0;
  NrfRadioPtr->EVENTS_RXREADY   = 0;
  NrfRadioPtr->EVENTS_TXREADY   = 0;
  NrfRadioPtr->EVENTS_ADDRESS   = 0;

  memcpy((void *)pduMem, (void *)inPduPtrE, sizeof(bcPdu));    // Daten in Funkpuffer kopieren
  memcpy((void *)pduSentE, (void *)inPduPtrE, sizeof(bcPdu));  // Daten in extra Puffer kopieren
  if(inPduPtrS != NULL)
    memcpy((void *)pduSentS, (void *)inPduPtrS, sizeof(bcPdu));// Daten in extra Puffer kopieren


  comFin    = false;
  comError  = false;
  newValues = inNewValues;

  trfMode = txMode;

#if (defined smnDEBUG  && defined nRF52840RadioDEB)
  statisticPtr = &statList[(int) txMode];
  statisticPtr->mode = txMode;
  memset(statisticPtr->memDumpRec,0,16);
  memset(statisticPtr->memDumpSnd,0,16);
#endif

  switch(txMode)
  {
    case txmBase:
      NrfRadioPtr->SHORTS = NrfScREADY_START | NrfScEND_DISABLE;
      NrfRadioPtr->TASKS_TXEN = 1;
      break;

    case txmRepStart:
      NrfRadioPtr->SHORTS = NrfScREADY_START;
      NrfRadioPtr->TASKS_TXEN = 1;
      break;

