RobertPatzke/homeautomation/libraries/nRF52840Radio/nRF52840Radio.cpp
    case txmRepCont:
      NrfRadioPtr->SHORTS = 0;
      NrfRadioPtr->TASKS_START = 1;
      break;

    case txmRepEnd:
      NrfRadioPtr->SHORTS = NrfScEND_DISABLE;
      NrfRadioPtr->TASKS_START = 1;
      break;

    case txmReadPrep:
      NrfRadioPtr->SHORTS = NrfScTXREADY_START | NrfScEND_DISABLE | NrfScDISABLED_RXEN;
      NrfRadioPtr->TASKS_TXEN = 1;
      break;

    case txmReadS:
      NrfRadioPtr->SHORTS = NrfScTXREADY_START | NrfScEND_DISABLE | NrfScDISABLED_RXEN | NrfScRXREADY_START;
      NrfRadioPtr->INTENSET = NrfIntADDRESS;
      NrfRadioPtr->TASKS_TXEN = 1;
      break;

    case txmRead:
      NrfRadioPtr->SHORTS = NrfScTXREADY_START | NrfScEND_DISABLE | NrfScDISABLED_RXEN | NrfScRXREADY_START;
      NrfRadioPtr->INTENSET = NrfIntADDRESS | NrfIntEND;
      NrfRadioPtr->TASKS_TXEN = 1;
      break;

    case txmPoll:
      recMode = false;
      NrfRadioPtr->SHORTS = NrfScTXREADY_START | NrfScEND_DISABLE | NrfScDISABLED_RXEN | NrfScRXREADY_START;
      NrfRadioPtr->INTENSET = NrfIntRXREADY;
      NrfRadioPtr->TASKS_TXEN = 1;
      break;

    case txmResp:
    case txmRespE:
      recMode = true;
      NrfRadioPtr->SHORTS = NrfScREADY_START;
      NrfRadioPtr->INTENSET = NrfIntEND;
      NrfRadioPtr->TASKS_RXEN = 1;
      break;
  }
}

void nRF52840Radio::disable(TxMode txMode)
{
  switch(txMode)
   {
     case txmBase:
       break;

     case txmRepStart:
       break;

     case txmRepCont:
       break;

     case txmRepEnd:
       break;

     case txmReadPrep:
       break;

     case txmRead:
       NrfRadioPtr->TASKS_DISABLE = 1;
       break;

     case txmPoll:
       NrfRadioPtr->INTENCLR = 0xFFFFFFFF;
       NrfRadioPtr->EVENTS_DISABLED = 0;
       NrfRadioPtr->TASKS_DISABLE = 1;
       break;

     case txmResp:
     case txmRespE:
       NrfRadioPtr->TASKS_DISABLE = 1;
       break;
   }
  NrfRadioPtr->SHORTS = 0;
}

bool nRF52840Radio::disabled(TxMode txMode)
{
  bool retv = false;

  switch(txMode)
   {
     case txmBase:
       break;

     case txmRepStart:
       break;

     case txmRepCont:
       break;

     case txmRepEnd:
       break;

     case txmReadPrep:
       break;

     case txmRead:
     case txmPoll:
       if(NrfRadioPtr->EVENTS_DISABLED == 1)
       {
         NrfRadioPtr->EVENTS_DISABLED = 0;
         retv = true;
       }
       else
       {
         if(NrfRadioPtr->STATE == NrfStDISABLED)
           retv = true;
       }
       break;

     case txmResp:
     case txmRespE:
       if(NrfRadioPtr->EVENTS_DISABLED == 1)
       {
         NrfRadioPtr->EVENTS_DISABLED = 0;
         retv = true;
       }
       else
       {
         if(NrfRadioPtr->STATE == NrfStDISABLED)
           retv = true;
       }
       break;
   }
  return(retv);
}

bool nRF52840Radio::fin(TxMode txMode, bool *crcErr)
{
  bool retv = false;

  *crcErr = comError;

  switch(txMode)
   {
     case txmBase:
       break;

     case txmRepStart:
       break;

     case txmRepCont:
       break;

     case txmRepEnd:
       break;

     case txmReadPrep:
       break;

     case txmReadS:
       retv = comFin;
       break;

     case txmRead:
       /*
       if(NrfRadioPtr->EVENTS_END == 1)
       {
         NrfRadioPtr->EVENTS_END = 0;
         retv = true;
       }
       else
       {
         if(NrfRadioPtr->STATE == NrfStRXIDLE)
           retv = true;
       }
       */
       retv = comFin;
       break;

     case txmPoll:
       retv = comFin;
       break;

     case txmResp:
       retv = comFin;
       break;

     case txmRespE:
       if(NrfRadioPtr->STATE == NrfStDISABLED && !recMode)
         retv = true;
       break;
   }
  return(retv);
}

void nRF52840Radio::cont(TxMode txMode)
{
  switch(txMode)
   {
     case txmBase:
       break;

     case txmRepStart:
       break;

     case txmRepCont:
       break;

     case txmRepEnd:
       break;

     case txmReadPrep:
       break;

     case txmRead:
       comFin = false;
       NrfRadioPtr->TASKS_START = 1;
       break;
   }
}

// ----------------------------------------------------------------------------
//                      E m p f a n g e n
// ----------------------------------------------------------------------------

// Starten des Datenempfangs
//
int nRF52840Radio::startRec()
{
  int   retv;
  NrfRadioPtr->INTENCLR = 0xFFFFFFFF;
  NrfRadioPtr->EVENTS_READY = 0;
  NrfRadioPtr->EVENTS_END = 0;
  NrfRadioPtr->EVENTS_ADDRESS = 0;
  NrfRadioPtr->EVENTS_PAYLOAD = 0;
  NrfRadioPtr->EVENTS_CRCOK = 0;
  NrfRadioPtr->EVENTS_CRCERROR = 0;
  NrfRadioPtr->TASKS_RXEN = 1;                  // Anlauf Empfänger starten
  retv = 8;
  while(NrfRadioPtr->EVENTS_READY != 1) retv++; // Warten bis angelaufen
  NrfRadioPtr->TASKS_START = 1;                 // Starten des Empfangs
  return(retv + 1);
}

// Fortsetzen des Datenempfangs
//
int nRF52840Radio::contRec()
{
  NrfRadioPtr->EVENTS_END = 0;
  NrfRadioPtr->EVENTS_ADDRESS = 0;
  NrfRadioPtr->EVENTS_PAYLOAD = 0;
  NrfRadioPtr->EVENTS_CRCOK = 0;
  NrfRadioPtr->EVENTS_CRCERROR = 0;
  NrfRadioPtr->TASKS_START = 1;                 // Starten des Empfangs
  return(6);
}

// Beenden des Datenempfangs
//
int nRF52840Radio::endRec()
{
  int   retv;
  NrfRadioPtr->EVENTS_DISABLED = 0;
  NrfRadioPtr->EVENTS_END = 0;
  NrfRadioPtr->EVENTS_ADDRESS = 0;
  NrfRadioPtr->EVENTS_PAYLOAD = 0;
  NrfRadioPtr->EVENTS_CRCOK = 0;
  NrfRadioPtr->EVENTS_CRCERROR = 0;
  NrfRadioPtr->TASKS_DISABLE = 1;               // Anlauf Empfänger beenden
  retv = 7;
  while(NrfRadioPtr->EVENTS_DISABLED != 1) retv++; // Warten bis abgelaufen
  return(retv);
}

// Empfangszustand abfragen
//
int nRF52840Radio::checkRec()
{
  int retv = 0;

  if(NrfRadioPtr->EVENTS_ADDRESS != 0)
    retv |= RECSTAT_ADDRESS;

  if(NrfRadioPtr->EVENTS_PAYLOAD != 0)
    retv |= RECSTAT_PAYLOAD;

  if(NrfRadioPtr->EVENTS_END != 0)
    retv |= RECSTAT_END;

  if(NrfRadioPtr->CRCSTATUS != 0)
    retv |= RECSTAT_CRCOK;

  if(NrfRadioPtr->EVENTS_DISABLED != 0)
    retv |= RECSTAT_DISABLED;

  return(retv);
}

int   nRF52840Radio::getRecData(bcPduPtr data, int max)
{
  int retv;
  byte *bPtr = (byte *) data;

  data->head = pduMem[0];
  retv = data->len  = pduMem[1];

  for(int i = 2; i < (retv + 2); i++)
  {
    if(i == max) break;
    bPtr[i] = pduMem[i];
  }

