RobertPatzke/homeautomation/libraries/nRF52840Radio/nRF52840Radio.cpp
  return(retv);
}

// ----------------------------------------------------------------------------
// Interruptverarbeitung
// ----------------------------------------------------------------------------
//

nRF52840Radio *nRF52840Radio::instPtr0 = NULL;

void nRF52840Radio::irqHandler0()
{
  if(instPtr0 == NULL) return;
  instPtr0->irqCounter++;
  instPtr0->irqHandler();
}

void nRF52840Radio::irqHandler()
{
  statisticPtr->interrupts++;

  switch(trfMode)
  {
    // ------------------------------------------------------------------------
    case txmRead:               // Empty Polling für Master
    // ------------------------------------------------------------------------

      if((NrfRadioPtr->STATE & 0x08) != 0)  // Noch im Sendemodus
      { // --------------------------------------------------------------------
        if(NrfRadioPtr->EVENTS_ADDRESS == 1)  // AC-Adr gesendet
        {
          NrfRadioPtr->EVENTS_ADDRESS = 0;    // nur quittieren
        }

        if(NrfRadioPtr->EVENTS_END == 1)      // Senden fertig
        {
          NrfRadioPtr->EVENTS_END = 0;        // nur quittieren
          statisticPtr->sendings++;
          memcpy(statisticPtr->memDumpSnd,pduMem,8);
        }
      }
      else                                  // im Empfangsmodus
      { // --------------------------------------------------------------------
        if(NrfRadioPtr->EVENTS_ADDRESS == 1)  // AC-Adr empfangen
        {
          NrfRadioPtr->EVENTS_ADDRESS = 0;    // quittieren
          NrfRadioPtr->SHORTS = 0;            // Direktverbindungen löschen
        }

        if(NrfRadioPtr->EVENTS_END == 1)      // Empfang fertig
        {
          NrfRadioPtr->EVENTS_END = 0;        // nur quittieren
          comFin = true;
          statisticPtr->recs++;
          memcpy(statisticPtr->memDumpRec,pduMem,8);
        }
      }

      break;

    // ------------------------------------------------------------------------
    case txmPoll:     // Empty Polling und Datenempfang für Master -> DISABLED
    // ------------------------------------------------------------------------
      if(NrfRadioPtr->EVENTS_RXREADY == 1)    // Empfang aktiviert
      {
        NrfRadioPtr->EVENTS_RXREADY = 0;      // Int quittieren

#if (defined smnDEBUG  && defined nRF52840RadioDEB)
        statisticPtr->sendings++;
        memcpy(statisticPtr->memDumpSnd,pduMem,8);
#endif
        NrfRadioPtr->EVENTS_DISABLED = 0;     // Neu erwartet, zurücksetzen
        NrfRadioPtr->SHORTS = NrfScEND_DISABLE | NrfScRXREADY_START;
        NrfRadioPtr->INTENSET = NrfIntDISABLED;
        recMode = true;
      }

      if(NrfRadioPtr->EVENTS_DISABLED == 1)   // Empfang beendet
      {
        NrfRadioPtr->EVENTS_DISABLED = 0;     // Int quittieren
        comFin = true;
        if(NrfRadioPtr->CRCSTATUS == 0)
          comError = true;

#if (defined smnDEBUG  && defined nRF52840RadioDEB)
        statisticPtr->recs++;
        if(comError) statisticPtr->crcErrors++;
        memcpy(statisticPtr->memDumpRec,pduMem,16);
        if(!recMode)
        {
          // Das darf nicht passieren, sonst neue Int-Verarbeitung erforderlich
          statisticPtr->intErrors++;
        }
#endif
      }
      break;

    // ------------------------------------------------------------------------
    case txmReadS:              // Datenübertragung für Master (Slave->Master)
    // ------------------------------------------------------------------------

      if(NrfRadioPtr->EVENTS_ADDRESS == 1)    // AC-Adr gesendet
      {
        NrfRadioPtr->EVENTS_ADDRESS = 0;      // quittieren

        if((NrfRadioPtr->STATE & 0x08) != 0)  // im Sendezustand
          break;                              // nichts weiter
        // --------------------------------------------------------------------
        else                                  // Im Empfangszustand
        {
          NrfRadioPtr->SHORTS = NrfScEND_DISABLE; // automatisch abschalten
          NrfRadioPtr->INTENCLR = 0xFFFFFFFF;     // und nur noch DISABLED
          NrfRadioPtr->INTENSET = NrfIntDISABLED; // Interrupt freischalten
        }
      }

      if(NrfRadioPtr->EVENTS_DISABLED == 1)   // Übertragung fertig
      {
        NrfRadioPtr->EVENTS_DISABLED = 0;     // quittieren
        comFin = true;
      }


      break;

    // ----------------------------------------------------------------------
    case txmRespE:              // Empty Polling für Slave
    // ----------------------------------------------------------------------

        // --------------------------------------------------------------------
        if(NrfRadioPtr->EVENTS_END == 1)        // Übertragung beendet
        // --------------------------------------------------------------------
        {
          NrfRadioPtr->EVENTS_END = 0;          // Event quittieren

          if(recMode)                           // im Empfangsmodus
          { // ----------------------------------------------------------------
            NrfRadioPtr->SHORTS = 0;            // keine direkte Kopplung mehr

            statisticPtr->recs++;
            memcpy(statisticPtr->memDumpRec,pduMem,8);

            // ----------------------------------------------------------------
            // Reaktion
            // ----------------------------------------------------------------
            //
            if((pduSentE[5] == pduMem[5]) && (pduSentE[6] == pduMem[6]) && (pduSentE[7] == pduMem[7]))
            {
              // Die richtige Protokollumgebung (z.B. Soaap)
              //
              if(pduSentE[2] != pduMem[2])
              {
                // aber die falsche Adresse
                // Datenempfang fortsetzen
                statisticPtr->wrongs++;
                NrfRadioPtr->TASKS_START = 1;
              }
              else
              { // richtige Adresse, Antwort schicken
                // ------------------------------------------------------------
                statisticPtr->pollNaks++;

                // zunächst alle Funk-Interrupts sperren
                NrfRadioPtr->INTENCLR = 0xFFFFFFFF;

                // Interrupt freigeben für "Abgeschaltet"
                NrfRadioPtr->INTENSET = NrfIntDISABLED;

                // Empfangsbetrieb abschalten
                NrfRadioPtr->TASKS_DISABLE = 1;
              }

