RobertPatzke/homeautomation/libraries/nRF52840Radio/nRF52840Radio.cpp
            }
            else
            {
              // Fremde Umgebung (nicht akzeptierte PDU)
              // Datenempfang fortsetzen
              statisticPtr->aliens++;
              NrfRadioPtr->TASKS_START = 1;
            }
          }
          else                                      // im Sendemodus
          { // ----------------------------------------------------------------


          }
        }

        // --------------------------------------------------------------------
        if(NrfRadioPtr->EVENTS_DISABLED == 1)       // ausgeschaltet
        // --------------------------------------------------------------------
        {
          NrfRadioPtr->EVENTS_DISABLED = 0;         // quittieren

          if(recMode)
          {
            // zunächst alle Funk-Interrupts sperren
            NrfRadioPtr->INTENCLR = 0xFFFFFFFF;

            // Interrupt freigeben für "Abgeschaltet"
            NrfRadioPtr->INTENSET = NrfIntDISABLED;

            // Kopplung automatisch starten und abschalten nach Ende
            NrfRadioPtr->SHORTS = NrfScREADY_START | NrfScEND_DISABLE;

            NrfRadioPtr->TASKS_TXEN = 1;             // Sender einschalten
            recMode = false;

            // Daten in Funkpuffer kopieren
            memcpy((void *)pduMem, (void *)pduSentE, sizeof(bcPdu));
          }
          else
          {
            NrfRadioPtr->SHORTS = 0;
            statisticPtr->sendings++;
          }
        }

        break;

      // ----------------------------------------------------------------------
      case txmResp:               // Datenübertragung Slave
      // ----------------------------------------------------------------------

        // --------------------------------------------------------------------
        if(NrfRadioPtr->EVENTS_END == 1)        // Übertragung beendet
        // --------------------------------------------------------------------
        {
          NrfRadioPtr->EVENTS_END = 0;          // Event quittieren

#if (defined smnDEBUG  && defined nRF52840RadioDEB)
          statisticPtr->recs++;
          memcpy(statisticPtr->memDumpRec,pduMem,8);
#endif

          if((pduSentE[5] != pduMem[5]) || (pduSentE[6] != pduMem[6]) || (pduSentE[7] != pduMem[7]))
          {
            // Das empfangene Telegramm gehört nicht zum eigenen Netzwerk
            //
#if (defined smnDEBUG  && defined nRF52840RadioDEB)
            statisticPtr->aliens++;
#endif
            NrfRadioPtr->SHORTS = 0;            // Keine Direktverbindungen
            NrfRadioPtr->TASKS_START = 1;       // Datenempfang fortsetzen
            break;
          }

          if((pduSentE[2] != pduMem[2]) || ((pduSentE[3] & 0x3F) != (pduMem[3] & 0x3F)))
          {
            // Das empfangene Telegramm ist für einen anderen Slave oder Bereich
            //
#if (defined smnDEBUG  && defined nRF52840RadioDEB)
            statisticPtr->wrongs++;
#endif
            NrfRadioPtr->SHORTS = 0;            // Keine Direktverbindungen
            NrfRadioPtr->TASKS_START = 1;       // Datenempfang fortsetzen
            break;
            // TODO
            // Hier wird das Protokoll noch erweitert zum Belauschen anderer Slaves
          }

          eadM = ((pduMem[3] & SOAAP_EADR) != 0); // Merker für Empfangspolling
          nakM = ((pduMem[3] & SOAAP_NAK) != 0);  // Merker für NAK-Polling

#if (defined smnDEBUG  && defined nRF52840RadioDEB)
          if(nakM)
            statisticPtr->pollNaks++;
          else
            statisticPtr->pollAcks++;
#endif
          if(eadM)
          {
            // Empfangsaufforderung
            // Eadr-Nak-Daten in Funkpuffer kopieren
            //
            memcpy((void *)pduMem, (void *)pduSentE, sizeof(bcPdu));
          }
          else
          {
            // Sendeaufforderung
            // Sadr-Ack-Daten in Funkpuffer kopieren
            //
            memcpy((void *)pduMem, (void *)pduSentS, sizeof(bcPdu));
          }

          // Setzen der Direktverbinder auf vollständigen Durchlauf bis Ende der Sendung
          // ACHTUNG! Freigegebene Interrupts treten auf, auch wenn sie zu einer
          //          Direktverbindung gehören.
          //
          NrfRadioPtr->SHORTS = NrfScDISABLED_TXEN | NrfScREADY_START | NrfScEND_DISABLE;
          NrfRadioPtr->EVENTS_READY = 0;        // Evt. hängendes Ereignis löschen
          NrfRadioPtr->INTENSET = NrfIntREADY;  // Int zur Vorbereitung des Sendeabschlusses
          NrfRadioPtr->TASKS_DISABLE = 1;       // Abschalten des Empfangsbetriebs
          break;
        }

        // --------------------------------------------------------------------
        if(NrfRadioPtr->EVENTS_READY == 1)      // Bereit zum Senden
        // --------------------------------------------------------------------
        {
          NrfRadioPtr->EVENTS_READY = 0;        // Event quittieren

          // Vorbereiten auf das Ende der Sendung mit Abschalten
          // NrfScREADY_START | NrfScEND_DISABLE sind weiter wirksam
          //
          NrfRadioPtr->SHORTS = NrfScREADY_START | NrfScEND_DISABLE;
          NrfRadioPtr->EVENTS_DISABLED = 0;       // Evt. hängendes Ereignis löschen
          recMode = false;
          NrfRadioPtr->INTENSET = NrfIntDISABLED; // Int zum Sendeabschluss
          break;
        }

        // --------------------------------------------------------------------
        if(NrfRadioPtr->EVENTS_DISABLED == 1)   // Sendevorgang beendet
        // --------------------------------------------------------------------
        {
          NrfRadioPtr->EVENTS_DISABLED = 0;     // Event quittieren
          comFin = true;
#if (defined smnDEBUG  && defined nRF52840RadioDEB)
          statisticPtr->sendings++;
          memcpy(statisticPtr->memDumpSnd,pduMem,16);
#endif
        }

        break;

      /*
      // ----------------------------------------------------------------------
      case txmResp:               // Datenübertragung Slave
      // ----------------------------------------------------------------------

        // --------------------------------------------------------------------
        if(NrfRadioPtr->EVENTS_END == 1)        // Übertragung beendet
        // --------------------------------------------------------------------
        {
          NrfRadioPtr->EVENTS_END = 0;          // Event quittieren

          if(recMode)                           // im Empfangsmodus (SADR/EADR)
          { // ----------------------------------------------------------------
            NrfRadioPtr->SHORTS = 0;            // keine direkte Kopplung mehr

            // ----------------------------------------------------------------
            // Reaktion
            // ----------------------------------------------------------------
            //
            if((pduSentE[5] == pduMem[5]) && (pduSentE[6] == pduMem[6]) && (pduSentE[7] == pduMem[7]))
            {
              // Die richtige Protokollumgebung (z.B. Soaap)
              //
              if(pduSentE[2] != pduMem[2])
              {
                // aber die falsche Adresse
                // Datenempfang fortsetzen
                statisticPtr->wrongs++;
                NrfRadioPtr->TASKS_START = 1;
              }
              else
              { // richtige Adresse, Antwort schicken
                // ------------------------------------------------------------
                eadM = ((pduMem[3] & SOAAP_EADR) != 0);
                nakM = ((pduMem[3] & SOAAP_NAK) != 0);

                if(nakM)
                  statisticPtr->pollNaks++;
                else
                  statisticPtr->pollAcks++;

