RobertPatzke/homeautomation/libraries/nRF52840Radio/nRF52840Radio.cpp
                // zunächst alle Funk-Interrupts sperren
                NrfRadioPtr->INTENCLR = 0xFFFFFFFF;

                // Interrupt freigeben für "Abgeschaltet"
                NrfRadioPtr->INTENSET = NrfIntDISABLED;

                // Empfangsbetrieb abschalten
                NrfRadioPtr->TASKS_DISABLE = 1;
              }

            }
            else
            {
              // Fremde Umgebung (nicht akzeptierte PDU)
              // Datenempfang fortsetzen
              statisticPtr->aliens++;
              NrfRadioPtr->TASKS_START = 1;
            }
          }
          else                                      // im Sendemodus
          { // ----------------------------------------------------------------
            //
            // Das wäre ein Fehler, kein END beim Senden erwartet sondern DISABLED
          }
        }

        // --------------------------------------------------------------------
        if(NrfRadioPtr->EVENTS_DISABLED == 1)       // ausgeschaltet
        // --------------------------------------------------------------------
        {
          NrfRadioPtr->EVENTS_DISABLED = 0;         // quittieren

          if(recMode)   // *** im Empfangsmodus ***
          {
            // zunächst alle Funk-Interrupts sperren
            NrfRadioPtr->INTENCLR = 0xFFFFFFFF;

            // Interrupt freigeben für "Abgeschaltet" (nach dem Senden)
            NrfRadioPtr->INTENSET = NrfIntDISABLED;

            // Kopplung automatisch starten und abschalten nach Ende
            NrfRadioPtr->SHORTS = NrfScREADY_START | NrfScEND_DISABLE;

            // Daten in Funkpuffer kopieren
            if(eadM)
              // ToDo: Hier auch auf Empfangspolling reagieren
              memcpy((void *)pduMem, (void *)pduSentE, sizeof(bcPdu));
            else
            {
              // Sendepolling, Daten je nach Modus manipulieren
              // --------------------------------------------------------------

              if(newValues || !nakM)
              // neue Messwerte oder Polling ohne Nak-Bit
              {
                newValues = false;  // neue Messwerte quittieren
                memcpy((void *)pduMem, (void *)pduSentS, sizeof(bcPdu));
                // ansonsten ist das Telegramm in pduSentS schon das Richtige
              }
              else
              // keine Daten, nur NAK (vom Master mit Nak-Bit gefordert)
              {
                memcpy((void *)pduMem, (void *)pduSentS, PollPduSize);
                BLE_LEN = PollAdrSize;
                BLE_ADR1 |= SOAAP_NAK;
              }
            }

            NrfRadioPtr->TASKS_TXEN = 1;            // Sender einschalten
            recMode = false;
          }
          else        // *** im Sendemodus ***
          {
            NrfRadioPtr->SHORTS = 0;
            statisticPtr->sendings++;
            comFin = true;                          // Pollvorgang abgeschlossen
          }
        }

        break;
        */
  }
}

// --------------------------------------------------------------------------
// Datenzugriffe
// --------------------------------------------------------------------------
//
int   nRF52840Radio::getStatistics(TxStatisticsPtr dest)
{
  int retv = 0;

  *dest = *statisticPtr;
  /*
  dest->aliens      = statisticPtr->aliens;
  dest->interrupts  = statisticPtr->interrupts;
  dest->mode        = statisticPtr->mode;
  dest->pollAcks    = statisticPtr->pollAcks;
  dest->pollNaks    = statisticPtr->pollNaks;
  dest->recs        = statisticPtr->recs;
  dest->sendings    = statisticPtr->sendings;
  dest->wrongs      = statisticPtr->wrongs;
  */
  return(retv);
}

int nRF52840Radio::getState()
{
  return(NrfRadioPtr->STATE);
}

// ----------------------------------------------------------------------------
//                      D e b u g - H i l f e n
// ----------------------------------------------------------------------------
//
int   nRF52840Radio::getPduMem(byte *dest, int start, int end)
{
  int i,j;

  j = 0;

  for(i = start; i < end; i++)
  {
    dest[j++] = pduMem[i];
  }
  return(j);
}

int   nRF52840Radio::getPduSent(byte *dest, int start, int end)
{
  int i,j;

  j = 0;

  for(i = start; i < end; i++)
  {
    dest[j++] = pduSentE[i];
  }
  return(j);
}







